Revit 2027 API
ExportFontTable.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportFontKey, ExportFontInfo))
public:
virtual IEnumerator<KeyValuePair<ExportFontKey^, ExportFontInfo^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
Return Value
IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace